posts/2024-12-28-interesting-rust-snippets.org
#+title: Interesting Rust snippets
#+date: <2024-12-28 10:21>
#+description: Some interesting Rust code snippets while learning.
#+filetags: rust program

* References
- [[https://rust-for-rustaceans.com/][Rust for Rustaceans]]
- [[https://rustlings.cool/][Rustlings]]
- [[https://tfpk.github.io/lifetimekata/][LifetimeKata]]
- Claude

