2024-12-28-interesting-rust-snippets.html
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org62935f2">1. References</a></li>
<li><a href="#org87fc779">2. Reference and lifetime</a></li>
<li><a href="#orgebad419">3. Traits</a>
<ul>
<li><a href="#org89b3bea">3.1. Associated types</a></li>
<li><a href="#org5c10eb1">3.2. Static/Dynamic dispatch</a></li>
<li><a href="#orgca620aa">3.3. Trait bounds</a></li>
<li><a href="#org48a674d">3.4. Existential types</a></li>
</ul>
</li>
<li><a href="#org83f62fb">4. Linked-list</a>
<ul>
<li><a href="#orge5d18c5">4.1. Leetcode 146: LRU cache</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org62935f2" class="outline-2">
<h2 id="org62935f2"><span class="section-number-2">1.</span> References</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://rust-for-rustaceans.com/">Rust for Rustaceans</a></li>
<li><a href="https://rustlings.cool/">Rustlings</a></li>
<li><a href="https://tfpk.github.io/lifetimekata/">LifetimeKata</a></li>
<li>Claude</li>
</ul>
</div>
</div>
<div id="outline-container-org87fc779" class="outline-2">
<h2 id="org87fc779"><span class="section-number-2">2.</span> Reference and lifetime</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">x</span>;
x = <span style="color: #da8548; font-weight: bold;">42</span>;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">y</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>x;
x = <span style="color: #da8548; font-weight: bold;">43</span>;
<span style="color: #51afef; font-weight: bold;">assert_eq!</span><span style="color: #51afef;">(</span>*y, <span style="color: #da8548; font-weight: bold;">42</span><span style="color: #51afef;">)</span>;
</pre>
</div>

<p>
The above code will cause compiler error at <code>x=43</code> since <code>x</code> has a shared reference which is still active after <code>x=43</code>. If we comment the <code>assert_eq!</code>, the code compiles.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">x</span> = <span style="color: #ECBE7B;">Vec</span>::new<span style="color: #51afef;">()</span>;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">y</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> x;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">z</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> x;
y.push<span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">42</span><span style="color: #51afef;">)</span>;
z.push<span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">13</span><span style="color: #51afef;">)</span>;
<span style="color: #51afef; font-weight: bold;">assert_eq!</span><span style="color: #51afef;">(</span>x, <span style="color: #c678dd;">[</span><span style="color: #da8548; font-weight: bold;">42</span>, <span style="color: #da8548; font-weight: bold;">13</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>;
</pre>
</div>

<p>
Similarly, the code above will cause compiler error at <code>let z = &amp;mut x</code> since at this point there exist two mutable references for <code>x</code>. If we swap this line with <code>y.push(42)</code>, the error is resolved because <code>y</code> is never used after <code>let z = &amp;mut x</code> now.
</p>

<p>
The compiler accepts the following code. In <code>*x = 84</code>, the borrow checker takes out a mutable reference to <code>x</code>, while there is also a shared reference <code>r = &amp;x</code> in the scope at the same time, since it is not accessed later, it does not create a conflict flow. Similarly, when <code>println!("{z}")</code>, the borrow checker walks back the path and finds no conflict until the <code>r</code> us created.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">x</span> = <span style="color: #ECBE7B;">Box</span>::new<span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">42</span><span style="color: #51afef;">)</span>;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">r</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>x; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">lifetime 'a starts</span>
<span style="color: #51afef;">if</span> rand<span style="color: #51afef;">()</span> &gt; <span style="color: #da8548; font-weight: bold;">0.5</span> <span style="color: #51afef;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">deref a Box returns a shared or a mutable reference</span>
    *x = <span style="color: #da8548; font-weight: bold;">84</span>;
<span style="color: #51afef;">}</span> <span style="color: #51afef;">else</span> <span style="color: #51afef;">{</span>
    <span style="color: #c678dd;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65; font-style: italic;">{z}</span><span style="color: #98be65;">"</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">println!("{z}");  // this will cause the compiler error</span>
</pre>
</div>

<p>
The following code also compiles, even when the lifetime is intermittently invalid:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">x</span> = <span style="color: #ECBE7B;">Box</span>::new<span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">42</span><span style="color: #51afef;">)</span>;
<span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">z</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>x;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">liefttime 'a starts</span>
<span style="color: #51afef;">for</span> <span style="color: #dcaeea;">i</span> <span style="color: #51afef;">in</span> <span style="color: #da8548; font-weight: bold;">0</span>..<span style="color: #da8548; font-weight: bold;">100</span> <span style="color: #51afef;">{</span>
    <span style="color: #c678dd;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">{</span><span style="color: #98be65;">"z"</span><span style="color: #98be65;">}</span><span style="color: #c678dd;">)</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">lifetime 'a ends here</span>
    x = <span style="color: #ECBE7B;">Box</span>::new<span style="color: #c678dd;">(</span>i<span style="color: #c678dd;">)</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">x is moved</span>
    z = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>x;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">restart lifetime 'a</span>
<span style="color: #51afef;">}</span>
<span style="color: #c678dd;">println!</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65; font-style: italic;">{z}</span><span style="color: #98be65;">"</span><span style="color: #51afef;">)</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">'a ends here</span>
</pre>
</div>

<p>
In the following code, we have to use two generic lifetime annotations:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">MutStr</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span>, '<span style="color: #dcaeea;">b</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_s</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #51afef;">mut</span> <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">b</span> <span style="color: #ECBE7B;">str</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">s</span> = <span style="color: #98be65;">"hello"</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">creates a 'static lifetime to "hello"</span>
*<span style="color: #ECBE7B;">MutStr</span> <span style="color: #51afef;">{</span><span style="color: #dcaeea;">_s</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> s<span style="color: #51afef;">}</span>._s = <span style="color: #98be65;">"world"</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">creates a mutable reference to s</span>
<span style="color: #c678dd;">println!</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65; font-style: italic;">{s}</span><span style="color: #98be65;">"</span><span style="color: #51afef;">)</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">creates a shared reference to s, now s is "world"</span>
</pre>
</div>

<p>
To <code>println("{s}")</code>, the borrow checker has to assume that the lifetime of the mutable reference to <code>s</code>  <code>'a</code> ends at the line before, and <code>'b</code> is always <code>'static</code> as a reference to a string slice.
If we use <code>'a</code> only, then the borrow checker tries to shorten <code>'static</code> to <code>'a</code>, but since the lifetime is behind <code>&amp;mut</code> which is invariant (see &ldquo;Rust for Rustaceans&rdquo; Ch 1), the conversion will fail.
</p>

<p>
Lifetimes are required when there exists mutable references in the function parameters, even if there is no output reference. In the following code, we need <code>'contents</code> to make sure the new inserted value lives for at least as long as the vector content.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">fn</span> <span style="color: #c678dd;">insert_value</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">vector</span>, '<span style="color: #dcaeea;">content</span><span style="color: #51afef;">&gt;(</span><span style="color: #dcaeea;">my_vec</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">vector</span> <span style="color: #51afef;">mut</span> <span style="color: #ECBE7B;">Vec</span><span style="color: #c678dd;">&lt;</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">content</span> <span style="color: #ECBE7B;">i32</span><span style="color: #c678dd;">&gt;</span>, <span style="color: #dcaeea;">value</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">content</span> <span style="color: #ECBE7B;">i32</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    my_vec.push<span style="color: #c678dd;">(</span>value<span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">value needs to live for as long as the contents of my_vec, aka my_vec</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">x</span> = <span style="color: #da8548; font-weight: bold;">1</span>;
    <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">my_vec</span> = <span style="color: #51afef; font-weight: bold;">vec!</span><span style="color: #c678dd;">[</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>x<span style="color: #c678dd;">]</span>;
    <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">y</span> = <span style="color: #da8548; font-weight: bold;">2</span>;
        insert_value<span style="color: #98be65;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> my_vec, <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>y<span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span>
    <span style="color: #c678dd;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65; font-style: italic;">{my_vec:?}</span><span style="color: #98be65;">"</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
It&rsquo;s important to note that the single lifetime does not work, see the usage below:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">fn</span> <span style="color: #c678dd;">insert_value</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span><span style="color: #51afef;">&gt;(</span><span style="color: #dcaeea;">my_vec</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #51afef;">mut</span> <span style="color: #ECBE7B;">Vec</span><span style="color: #c678dd;">&lt;</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">i32</span><span style="color: #c678dd;">&gt;</span>, <span style="color: #dcaeea;">value</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">i32</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    my_vec.push<span style="color: #c678dd;">(</span>value<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
<span style="color: #51afef;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">my_vec</span>: <span style="color: #ECBE7B;">Vec</span><span style="color: #c678dd;">&lt;</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #ECBE7B;">i32</span><span style="color: #c678dd;">&gt;</span> = <span style="color: #51afef; font-weight: bold;">vec!</span><span style="color: #c678dd;">[]</span>;
    <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">val1</span> = <span style="color: #da8548; font-weight: bold;">1</span>;
    <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">val2</span> = <span style="color: #da8548; font-weight: bold;">2</span>;
    insert_value<span style="color: #c678dd;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> my_vec, <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>val1<span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&amp;val1 needs to live until the vector is dropped</span>
                                      <span style="color: #5B6268;">// </span><span style="color: #5B6268;">so is &amp;mut my_vec now</span>
    insert_value<span style="color: #c678dd;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> my_vec, <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>val2<span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">the last &amp;mut my_vec is still valid!</span>
    <span style="color: #c678dd;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65; font-style: italic;">{my_vec:?}</span><span style="color: #98be65;">"</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
We need to explicitly annotate the lifetime in the structs and its implementation. In the following code, <code>next_word</code> uses a second lifetime annotation to decouple the lifetime of the mutable reference to <code>WordIterator</code> and the next world, otherwise we have to drop the previous next word before getting a new next word.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">WordIterator</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">s</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">position</span>: <span style="color: #ECBE7B;">usize</span>,
    <span style="color: #dcaeea;">string</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">s</span> <span style="color: #ECBE7B;">str</span>,
<span style="color: #51afef;">}</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">impl&lt;'a&gt; defines a lifetime</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">WordIterator&lt;'a&gt; says the references in WordIterator must live for 'a</span>
<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">WordIterator</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">new</span><span style="color: #c678dd;">(</span><span style="color: #dcaeea;">string</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">str</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">WordIterator</span><span style="color: #c678dd;">&lt;</span>'<span style="color: #dcaeea;">a</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">WordIterator</span> <span style="color: #98be65;">{</span>
            <span style="color: #dcaeea;">position</span>: <span style="color: #da8548; font-weight: bold;">0</span>,
            string,
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Gives the next word, None if there is no word left</span>
    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">next_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">b</span> <span style="color: #51afef;">mut</span> <span style="color: #51afef;">self</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">Option</span><span style="color: #c678dd;">&lt;</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">str</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-weight: bold;">todo!</span><span style="color: #98be65;">()</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
We can also use lifetime bounds to specify <code>'a</code> should outlives, i.e., live for at least as long as <code>'b</code> with <code>'a: 'b</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">fn</span> <span style="color: #c678dd;">f</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span>, '<span style="color: #dcaeea;">b</span><span style="color: #51afef;">&gt;(</span><span style="color: #dcaeea;">x</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">i32</span>, <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">y</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">b</span> <span style="color: #ECBE7B;">i32</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">where</span>
    '<span style="color: #dcaeea;">a</span>: '<span style="color: #dcaeea;">b</span>,
<span style="color: #51afef;">{</span>
    y = x; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&amp;'a i32 is a subtype of &amp;'b</span>
    <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">r</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">b</span> <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">i32</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;&amp;</span><span style="color: #da8548; font-weight: bold;">0</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&amp;'b is never dangling</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
