2024-12-28-interesting-rust-snippets.html
<div id="outline-container-orgebad419" class="outline-2">
<h2 id="orgebad419"><span class="section-number-2">3.</span> Traits</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org89b3bea" class="outline-3">
<h3 id="org89b3bea"><span class="section-number-3">3.1.</span> Associated types</h3>
<div class="outline-text-3" id="text-3-1">
<p>
One should use associated types instead of generic type parameters in a trait if there should only exist one trait implementation for any type. For instance, for any given type, the <code>Item</code> type should be unambiguous even if type contains generic parameters.
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #5B6268;">/* </span><span style="color: #5B6268;">standard trait</span>
<span style="color: #5B6268;">trait Iterator {</span>
<span style="color: #5B6268;">    type Item;</span>
<span style="color: #5B6268;">    fn next(&amp;mut self) -&gt; Option&lt;Self::Item&gt;;</span>
<span style="color: #5B6268;">}</span>
<span style="color: #5B6268;">*/</span>

<span style="color: #51afef; font-weight: bold;">#</span><span style="color: #51afef; font-weight: bold;">[</span><span style="color: #51afef; font-weight: bold;">derive</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #51afef; font-weight: bold;">Default</span><span style="color: #c678dd; font-weight: bold;">)</span><span style="color: #51afef; font-weight: bold;">]</span>
<span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">MyVec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">we cannot directly implement Iterator for MyVec&lt;T&gt; as it does not store internal states.</span>
    <span style="color: #dcaeea;">vec</span>: <span style="color: #ECBE7B;">Vec</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">MyVecIter</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">vec</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">Vec</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span>,
    <span style="color: #dcaeea;">position</span>: <span style="color: #ECBE7B;">usize</span>,
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">Iterator</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">MyVecIter</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">Item</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">T</span>;

    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">next</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> <span style="color: #51afef;">self</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">Option</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Self</span>::<span style="color: #ECBE7B;">Item</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">self</span>.position &lt; <span style="color: #51afef;">self</span>.vec.len<span style="color: #98be65;">()</span> <span style="color: #98be65;">{</span>
            <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">item</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">self</span>.vec<span style="color: #a9a1e1;">[</span><span style="color: #51afef;">self</span>.position<span style="color: #a9a1e1;">]</span>;
            <span style="color: #51afef;">self</span>.position += <span style="color: #da8548; font-weight: bold;">1</span>;
            <span style="color: #ECBE7B;">Some</span><span style="color: #a9a1e1;">(</span>item<span style="color: #a9a1e1;">)</span>
        <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
            <span style="color: #ECBE7B;">None</span>
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">MyVec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">iter</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">self</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">MyVecIter</span><span style="color: #c678dd;">&lt;</span>'<span style="color: #dcaeea;">_</span>, <span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">{</span>  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">this does not consume MyIter</span>
        <span style="color: #ECBE7B;">MyVecIter</span> <span style="color: #98be65;">{</span>
            <span style="color: #dcaeea;">vec</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">self</span>.vec,
            <span style="color: #dcaeea;">position</span>: <span style="color: #da8548; font-weight: bold;">0</span>,
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">IntoIterator</span> <span style="color: #51afef;">for</span> <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">MyVec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">this consumes MyIter</span>
    <span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">Item</span> = <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">T</span>;
    <span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">IntoIter</span> = <span style="color: #ECBE7B;">MyVecIter</span><span style="color: #c678dd;">&lt;</span>'<span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span>;

    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">into_iter</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">self</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">Self</span>::<span style="color: #ECBE7B;">IntoIter</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">self</span>.iter<span style="color: #98be65;">()</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">usage</span>
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">my_vec</span> = <span style="color: #ECBE7B;">MyVec</span>::<span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">i32</span><span style="color: #51afef;">&gt;</span>::default<span style="color: #51afef;">()</span>;
<span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">my_vec_iter</span> = my_vec.into_iter<span style="color: #51afef;">()</span>;
my_vec_iter.next<span style="color: #51afef;">()</span>;
</pre>
</div>

<p>
On the other hands, sometimes we want multiple trait implementations for the given type, e.g., convert a type to both <code>String</code> and <code>i32</code>, or when the type has different generic bounds:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">impl</span> <span style="color: #ECBE7B;">From</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">i32</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">MyType</span> <span style="color: #51afef;">{}</span>

<span style="color: #51afef;">impl</span> <span style="color: #ECBE7B;">From</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">MyType</span> <span style="color: #51afef;">{}</span>

<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">MyTrait</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">Vec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">where</span> <span style="color: #dcaeea;">T</span>: <span style="color: #ECBE7B;">Display</span> <span style="color: #51afef;">{}</span>

<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">MyTrait</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">Vec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">where</span> <span style="color: #dcaeea;">T</span>: <span style="color: #ECBE7B;">Debug</span> <span style="color: #51afef;">{}</span>
</pre>
</div>
</div>
</div>
