posts/2024-12-28-interesting-rust-snippets.org
** Static/Dynamic dispatch

There are two ways to pass into a function a type that implements a trait: static dispatch and dynamic dispatch:

#+begin_src rust
fn static_dispatch(item: impl MyTrait) {}  // or static_dispatch<T: MyTrait>(item: T) {}

fn dynamic_dispatch(item: &dyn MyTrait) {}
#+end_src

Static dispatch tells the compiler to make a copy of the function for each ~T~ and replace each generic parameter with the concrete type provided, which is called monomorphization.
In this way the compiler can optimize the generic code just at non-generic code. To avoid generating duplicated machine code, one can declare a non-generic inner function inside the generic function.

When calling ~dynamic_dispatch~, the caller passes a trait object, which is the combination of a type that implements the trait and a pointer to its virtual method table (vtable) which holds all trait method implementations of this type. Since ~dyn~ is not resolved during the compile time, it is ~!Sized~ and hence it needs to be a wide pointer (~&dyn~) holder, e.g., ~&mut~, ~Box~ or ~Arc~.

Only object-safe traits can allow dynamic dispatch. An object-safe trait must satisfy:
1. All methods are object-safe:
   1. No generic parameters,
   2. No ~Self~ as return type, otherwise the memory layout cannot be determined during the compile time.
   3. No static methods, i.e., must take ~&self~ or ~&mut self~, otherwise the vtable is not available.
2. Trait cannot be ~Sized~ bound, otherwise it's against the nature of dynamic dispatch.

Broadly speaking, use static dispatch in a library, and dynamic dispatch in a binary (no other users):

#+begin_src rust
pub struct DynamicLogger {
    writer: Box<dyn Write>
}

pub struct StaticLogger<W: Write> {
    writer: W
}

// usage
let file = File::create("dynamic_log.txt")?;
let dynamic_logger = DynamicLogger { writer: Box::new(file) };  // Users are forced to use dynamic dispatch

// Both works for static dispatch
let file = File::create("static_log.txt")?;
let logger = Logger { writer: file };

let file: Box<dyn Write> = Box::new(File::create("static_log.txt")?);
let logger = Logger { writer: file };
#+end_src

** Trait bounds
#+begin_src rust
fn collect_to_map<T, S>(items: impl IntoIterator<Item = T>) -> HashMap<T, usize, S>
where
   HashMap<T, usize, S>: FromIterator<(T, usize)>
{
   items
       .into_iter()
       .enumerate()
       .map(|(i, item)| (item, i))
       .collect()
}
#+end_src

The trait above is better than explicitly writing ~T: Hash + Eq~ and ~S: BuildHasher + Default~ since they are implicitly required for ~HashMap~ to implement ~FromIterator~.

#+begin_src rust
impl Debug for AnyIterable
where
    // the reference to Self implements IntoIterator for any lifetime 'a
    for<'a> &'a Self: IntoIterator,
    // the item (associated type in Self) produced by iterating over the reference to Self implement Debug
    // We cannnot write <&'a Self>::Item because the associated type Item only exists in IntoIterator
    for<'a> <&'a Self as IntoIterator>::Item: Debug,
{
    // since fmt signature does not allow lifetime annotation,
    // we need to specify "the reference implements the trait for any lifetime"
    fn fmt(&self, f: &mut Formatter) -> Result<(), Error> {
        f.debug_list()  // formats items, e.g., [item1, item2]
            .entries(self) // iterates over self and debug-formatted each item
            .finish()
    }
}
#+end_src

The code above adds trait bounds for both outer type and the inner associated type. It implement ~Debug~ for any type that can be iterated over and whose elements are ~Debug~.

