2024-12-28-interesting-rust-snippets.html
<div id="outline-container-org5c10eb1" class="outline-3">
<h3 id="org5c10eb1"><span class="section-number-3">3.2.</span> Static/Dynamic dispatch</h3>
<div class="outline-text-3" id="text-3-2">
<p>
There are two ways to pass into a function a type that implements a trait: static dispatch and dynamic dispatch:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">fn</span> <span style="color: #c678dd;">static_dispatch</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">item</span>: <span style="color: #51afef;">impl</span> <span style="color: #ECBE7B;">MyTrait</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{}</span>  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">or static_dispatch&lt;T: MyTrait&gt;(item: T) {}</span>

<span style="color: #51afef;">fn</span> <span style="color: #c678dd;">dynamic_dispatch</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">item</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">dyn</span> <span style="color: #ECBE7B;">MyTrait</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{}</span>
</pre>
</div>

<p>
Static dispatch tells the compiler to make a copy of the function for each <code>T</code> and replace each generic parameter with the concrete type provided, which is called monomorphization.
In this way the compiler can optimize the generic code just at non-generic code. To avoid generating duplicated machine code, one can declare a non-generic inner function inside the generic function.
</p>

<p>
When calling <code>dynamic_dispatch</code>, the caller passes a trait object, which is the combination of a type that implements the trait and a pointer to its virtual method table (vtable) which holds all trait method implementations of this type. Since <code>dyn</code> is not resolved during the compile time, it is <code>!Sized</code> and hence it needs to be a wide pointer (<code>&amp;dyn</code>) holder, e.g., <code>&amp;mut</code>, <code>Box</code> or <code>Arc</code>.
</p>

<p>
Only object-safe traits can allow dynamic dispatch. An object-safe trait must satisfy:
</p>
<ol class="org-ol">
<li>All methods are object-safe:
<ol class="org-ol">
<li>No generic parameters,</li>
<li>No <code>Self</code> as return type, otherwise the memory layout cannot be determined during the compile time.</li>
<li>No static methods, i.e., must take <code>&amp;self</code> or <code>&amp;mut self</code>, otherwise the vtable is not available.</li>
</ol></li>
<li>Trait cannot be <code>Sized</code> bound, otherwise it&rsquo;s against the nature of dynamic dispatch.</li>
</ol>

<p>
Broadly speaking, use static dispatch in a library, and dynamic dispatch in a binary (no other users):
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">pub</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">DynamicLogger</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">writer</span>: <span style="color: #ECBE7B;">Box</span><span style="color: #c678dd;">&lt;</span><span style="color: #51afef;">dyn</span> <span style="color: #ECBE7B;">Write</span><span style="color: #c678dd;">&gt;</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">pub</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">StaticLogger</span><span style="color: #51afef;">&lt;</span><span style="color: #dcaeea;">W</span>: <span style="color: #ECBE7B;">Write</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">writer</span>: <span style="color: #ECBE7B;">W</span>
<span style="color: #51afef;">}</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">usage</span>
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">file</span> = <span style="color: #ECBE7B;">File</span>::create<span style="color: #51afef;">(</span><span style="color: #98be65;">"dynamic_log.txt"</span><span style="color: #51afef;">)</span><span style="color: #c678dd; font-weight: bold;">?</span>;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">dynamic_logger</span> = <span style="color: #ECBE7B;">DynamicLogger</span> <span style="color: #51afef;">{</span> <span style="color: #dcaeea;">writer</span>: <span style="color: #ECBE7B;">Box</span>::new<span style="color: #c678dd;">(</span>file<span style="color: #c678dd;">)</span> <span style="color: #51afef;">}</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Users are forced to use dynamic dispatch</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Both works for static dispatch</span>
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">file</span> = <span style="color: #ECBE7B;">File</span>::create<span style="color: #51afef;">(</span><span style="color: #98be65;">"static_log.txt"</span><span style="color: #51afef;">)</span><span style="color: #c678dd; font-weight: bold;">?</span>;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">logger</span> = <span style="color: #ECBE7B;">Logger</span> <span style="color: #51afef;">{</span> <span style="color: #dcaeea;">writer</span>: file <span style="color: #51afef;">}</span>;

<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">file</span>: <span style="color: #ECBE7B;">Box</span><span style="color: #51afef;">&lt;</span><span style="color: #51afef;">dyn</span> <span style="color: #ECBE7B;">Write</span><span style="color: #51afef;">&gt;</span> = <span style="color: #ECBE7B;">Box</span>::new<span style="color: #51afef;">(</span><span style="color: #ECBE7B;">File</span>::create<span style="color: #c678dd;">(</span><span style="color: #98be65;">"static_log.txt"</span><span style="color: #c678dd;">)</span><span style="color: #c678dd; font-weight: bold;">?</span><span style="color: #51afef;">)</span>;
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">logger</span> = <span style="color: #ECBE7B;">Logger</span> <span style="color: #51afef;">{</span> <span style="color: #dcaeea;">writer</span>: file <span style="color: #51afef;">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca620aa" class="outline-3">
<h3 id="orgca620aa"><span class="section-number-3">3.3.</span> Trait bounds</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">fn</span> <span style="color: #c678dd;">collect_to_map</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">S</span><span style="color: #51afef;">&gt;(</span><span style="color: #dcaeea;">items</span>: <span style="color: #51afef;">impl</span> <span style="color: #ECBE7B;">IntoIterator</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Item</span> = <span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span><span style="color: #51afef;">)</span> -&gt; <span style="color: #ECBE7B;">HashMap</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">usize</span>, <span style="color: #ECBE7B;">S</span><span style="color: #51afef;">&gt;</span>
<span style="color: #51afef;">where</span>
   <span style="color: #ECBE7B;">HashMap</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">usize</span>, <span style="color: #ECBE7B;">S</span><span style="color: #51afef;">&gt;</span>: <span style="color: #ECBE7B;">FromIterator</span><span style="color: #51afef;">&lt;</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">usize</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">&gt;</span>
<span style="color: #51afef;">{</span>
   items
       .into_iter<span style="color: #c678dd;">()</span>
       .enumerate<span style="color: #c678dd;">()</span>
       .map<span style="color: #c678dd;">(</span>|<span style="color: #98be65;">(</span>i, item<span style="color: #98be65;">)</span>| <span style="color: #98be65;">(</span>item, i<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
       .collect<span style="color: #c678dd;">()</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
The trait above is better than explicitly writing <code>T: Hash + Eq</code> and <code>S: BuildHasher + Default</code> since they are implicitly required for <code>HashMap</code> to implement <code>FromIterator</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">impl</span> <span style="color: #ECBE7B;">Debug</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">AnyIterable</span>
<span style="color: #51afef;">where</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">the reference to Self implements IntoIterator for any lifetime 'a</span>
    <span style="color: #51afef;">for</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span><span style="color: #51afef;">&gt;</span> <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #dcaeea;">Self</span>: <span style="color: #ECBE7B;">IntoIterator</span>,
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">the item (associated type in Self) produced by iterating over the reference to Self implement Debug</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">We cannnot write &lt;&amp;'a Self&gt;::Item because the associated type Item only exists in IntoIterator</span>
    <span style="color: #51afef;">for</span><span style="color: #51afef;">&lt;</span>'<span style="color: #dcaeea;">a</span><span style="color: #51afef;">&gt;</span> &lt;<span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>'<span style="color: #dcaeea;">a</span> <span style="color: #ECBE7B;">Self</span> <span style="color: #51afef;">as</span> <span style="color: #ECBE7B;">IntoIterator</span>&gt;::<span style="color: #dcaeea;">Item</span>: <span style="color: #ECBE7B;">Debug</span>,
<span style="color: #51afef;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">since fmt signature does not allow lifetime annotation,</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">we need to specify "the reference implements the trait for any lifetime"</span>
    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">fmt</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">self</span>, <span style="color: #dcaeea;">f</span>: <span style="color: #bbc2cf; background-color: #282c34;">&amp;</span><span style="color: #51afef;">mut</span> <span style="color: #ECBE7B;">Formatter</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">Result</span><span style="color: #c678dd;">&lt;</span><span style="color: #98be65;">()</span>, <span style="color: #ECBE7B;">Error</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">{</span>
        f.debug_list<span style="color: #98be65;">()</span>  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">formats items, e.g., [item1, item2]</span>
            .entries<span style="color: #98be65;">(</span><span style="color: #51afef;">self</span><span style="color: #98be65;">)</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">iterates over self and debug-formatted each item</span>
            .finish<span style="color: #98be65;">()</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
The code above adds trait bounds for both outer type and the inner associated type. It implement <code>Debug</code> for any type that can be iterated over and whose elements are <code>Debug</code>.
</p>
</div>
</div>
