2024-12-28-interesting-rust-snippets.html
<div id="outline-container-org48a674d" class="outline-3">
<h3 id="org48a674d"><span class="section-number-3">3.4.</span> Existential types</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-weight: bold;">#!</span><span style="color: #51afef; font-weight: bold;">[</span><span style="color: #51afef; font-weight: bold;">feature</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #51afef; font-weight: bold;">impl_trait_in_assoc_type</span><span style="color: #c678dd; font-weight: bold;">)</span><span style="color: #51afef; font-weight: bold;">]</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">require nightly</span>

<span style="color: #51afef; font-weight: bold;">#</span><span style="color: #51afef; font-weight: bold;">[</span><span style="color: #51afef; font-weight: bold;">derive</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #51afef; font-weight: bold;">Default</span><span style="color: #c678dd; font-weight: bold;">)</span><span style="color: #51afef; font-weight: bold;">]</span>
<span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">MyVec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">vec</span>: <span style="color: #ECBE7B;">Vec</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span>,
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">impl</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">IntoIterator</span> <span style="color: #51afef;">for</span> <span style="color: #ECBE7B;">MyVec</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">Item</span> = <span style="color: #ECBE7B;">T</span>;
    <span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">IntoIter</span> = <span style="color: #51afef;">impl</span> <span style="color: #ECBE7B;">Iterator</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Item</span> = <span style="color: #ECBE7B;">Self</span>::<span style="color: #ECBE7B;">Item</span><span style="color: #c678dd;">&gt;</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">existential type</span>

    <span style="color: #51afef;">fn</span> <span style="color: #c678dd;">into_iter</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">self</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">Self</span>::<span style="color: #ECBE7B;">IntoIter</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">vec</span> = <span style="color: #51afef;">self</span>.vec;
        <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">position</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
        <span style="color: #a9a1e1;">std</span>::<span style="color: #a9a1e1;">iter</span>::from_fn<span style="color: #98be65;">(</span><span style="color: #51afef;">move</span> || <span style="color: #a9a1e1;">{</span>
            <span style="color: #51afef;">if</span> position &lt; vec.len<span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
                <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">item</span> = vec.remove<span style="color: #c678dd;">(</span>position<span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">consume vec</span>
                <span style="color: #ECBE7B;">Some</span><span style="color: #c678dd;">(</span>item<span style="color: #c678dd;">)</span>
            <span style="color: #51afef;">}</span> <span style="color: #51afef;">else</span> <span style="color: #51afef;">{</span>
                <span style="color: #ECBE7B;">None</span>
            <span style="color: #51afef;">}</span>
        <span style="color: #a9a1e1;">}</span><span style="color: #98be65;">)</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">let</span> <span style="color: #51afef;">mut</span> <span style="color: #dcaeea;">my_vec</span> = <span style="color: #ECBE7B;">MyVec</span>::<span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">i32</span><span style="color: #c678dd;">&gt;</span>::default<span style="color: #c678dd;">()</span>.into_iter<span style="color: #c678dd;">()</span>;
    <span style="color: #c678dd;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65; font-style: italic;">{:?}</span><span style="color: #98be65;">"</span>, my_vec.next<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
The code above uses existential types in the associated types to avoid creating new type <code>MyVecIter</code>, hence perform zero-cost type erasure.
</p>
</div>
</div>
</div>
